In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('final_food_delivery_dataset.csv')

In [3]:
df.shape

(10000, 12)

In [4]:
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

# Section 1 - Multiple Choice Questions

### 1. Which city has the highest total revenue (total_amount) from Gold members?

In [6]:
df[df["membership"] == "Gold"].groupby("city")["total_amount"].sum().sort_values(ascending=False).head(1)

city
Chennai    1080909.79
Name: total_amount, dtype: float64

### 2. Which cuisine has the highest average order value across all orders?

In [8]:
df.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False).head(1)

cuisine
Mexican    808.021344
Name: total_amount, dtype: float64

### 3. How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

In [10]:
df.groupby('user_id')['total_amount'].sum().gt(1000).sum()

2544

### 4. Which restaurant rating range generated the highest total revenue?

In [12]:
df["rating_range"] = pd.cut(
    df["rating"],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0],
    labels=["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"],
    include_lowest=True
)
rating_revenue = (
    df.groupby("rating_range",observed=True)["total_amount"]
      .sum()
      .sort_values(ascending=False)
)

rating_revenue.head(1)

rating_range
4.6–5.0    2197030.75
Name: total_amount, dtype: float64

### 5. Among Gold members, which city has the highest average order value?

In [14]:
df[df['membership']=='Gold'].groupby('city')['total_amount'].mean().sort_values(ascending=False).head(1)

city
Chennai    808.45908
Name: total_amount, dtype: float64

### 6. Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

In [16]:
df.groupby("cuisine").agg(
    num_restaurants=("restaurant_id", "nunique"),
    total_revenue=("total_amount", "sum")
).sort_values(
    ["num_restaurants", "total_revenue"],
    ascending=[True, False]
)

         num_restaurants  total_revenue
cuisine
Chinese              120     1930504.65
Italian              126     2024203.80
Indian               126     1971412.58
Mexican              128     2085503.09

### 7. What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

In [18]:
f"{round((df["membership"] == "Gold").mean() * 100)} %"

'50 %'

In [19]:
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating,rating_range
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2,3.0–3.5
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5,4.1–4.5
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0,3.6–4.0
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8,4.6–5.0
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0,3.0–3.5

### 8. Which restaurant has the highest average order value but less than 20 total orders?

In [21]:
df.groupby("restaurant_name_y").agg(
    total_orders=("order_id", "count"),
    avg_order_value=("total_amount", "mean")
).query("total_orders < 20").sort_values(
    "avg_order_value", ascending=False
).head(1)

                   total_orders  avg_order_value
restaurant_name_y
Restaurant_294               13      1040.222308

In [22]:
df[df['restaurant_name_y']=='Restaurant_294']

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating,rating_range
1407,1408,2895,294,2023-08-22,817.71,Hotel Dhaba Multicuisine,User_2895,Chennai,Gold,Restaurant_294,Italian,3.1,3.0–3.5
1643,1644,1363,294,2023-09-29,1327.91,Hotel Dhaba Multicuisine,User_1363,Bangalore,Gold,Restaurant_294,Italian,3.1,3.0–3.5
2426,2427,2944,294,2023-08-30,629.97,Hotel Dhaba Multicuisine,User_2944,Hyderabad,Gold,Restaurant_294,Italian,3.1,3.0–3.5
3174,3175,315,294,2023-11-20,1004.28,Hotel Dhaba Multicuisine,User_315,Chennai,Gold,Restaurant_294,Italian,3.1,3.0–3.5
3243,3244,2100,294,2023-03-08,1189.93,Hotel Dhaba Multicuisine,User_2100,Hyderabad,Regular,Restaurant_294,Italian,3.1,3.0–3.5
4007,4008,2137,294,2023-02-13,1082.37,Hotel Dhaba Multicuisine,User_2137,Pune,Gold,Restaurant_294,Italian,3.1,3.0–3.5
4999,5000,1478,294,2023-10-24,943.66,Hotel Dhaba Multicuisine,User_1478,Pune,Gold,Restaurant_294,Italian,3.1,3.0–3.5
5157,5158,701,294,2023-07-08,1290.51,Hotel Dhaba Multicuisine,User_701,Hyderabad,Regular,Restaurant_294,Italian,3.1,3.0–3.5
5718,5719,1223,294,2023-10-13,1400.13,Hotel Dhaba Multicuisine,User_1223,Chennai,Regular,Restaurant_294,Italian,3.1,3.0–3.5
5851,5852,2089,294,2023-11-18,1175.40,Hotel Dhaba Multicuisine,User_2089,Hyderabad,Gold,Restaurant_294,Italian,3.1,3.0–3.5
6155,6156,545,294,2024-01-01,1070.86,Hotel Dhaba Multicuisine,User_545,Pune,Regular,Restaurant_294,Italian,3.1,3.0–3.5
8840,8841,2381,294,2023-12-04,631.82,Hotel Dhaba Multicuisine,User_2381,Pune,Regular,Restaurant_294,Italian,3.1,3.0–3.5
9439,9440,2681,294,2023-11-12,958.34,Hotel Dhaba Multicuisine,User_2681,Chennai,Gold,Restaurant_294,Italian,3.1,3.0–3.5

In [23]:
df.groupby(['membership', 'cuisine'])['total_amount'].sum().sort_values(ascending=False).head(1)

membership  cuisine
Regular     Mexican    1072943.3
Name: total_amount, dtype: float64

In [57]:
options = [
    'Grand Cafe Punjabi', 
    'Grand Restaurant South Indian', 
    'Ruchi Mess Multicuisine', 
    'Ruchi Foods Chinese'
]

df_filtered = df[df['restaurant_name_x'].isin(options)]

rest_stats = df_filtered.groupby('restaurant_name_x').agg(
    avg_order_value=('total_amount', 'mean'),
    total_orders=('order_id', 'count')
)
top_small_rest = rest_stats.query('total_orders < 20').sort_values('avg_order_value', ascending=False).index[0]

top_small_rest

'Ruchi Foods Chinese'

### 9. Which combination contributes the highest revenue?

In [25]:
combo_revenue = (
    df.groupby(["membership", "cuisine"])["total_amount"].sum().sort_values(ascending=False)
)
combo_revenue.loc[
    [("Gold", "Indian"),
     ("Gold", "Italian"),
     ("Regular", "Indian"),
     ("Regular", "Chinese")]
].sort_values(ascending=False)

membership  cuisine
Gold        Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

### 10. During which quarter of the year is the total revenue highest?

In [27]:
df["order_date"] = pd.to_datetime(df["order_date"])
df["quarter"] = df["order_date"].dt.quarter
df.groupby(df["order_date"].dt.quarter)["total_amount"].sum().idxmax()

3

In [28]:
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating,rating_range,quarter
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2,3.0–3.5,1
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5,4.1–4.5,1
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0,3.6–4.0,3
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8,4.6–5.0,4
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0,3.0–3.5,4

# Section 2 - Numerical answers

### 1. How many total orders were placed by users with Gold membership?

In [31]:
len(df[df["membership"] == "Gold"])

4987

### 2. What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

In [33]:
revenue = df.loc[df["city"] == "Hyderabad", "total_amount"].sum()
round(revenue)

1889367

### 3. How many distinct users placed at least one order?

In [35]:
df["user_id"].nunique()

2883

### 4. What is the average order value (rounded to 2 decimals) for Gold members?

In [37]:
avg_gold = df.loc[df["membership"] == "Gold", "total_amount"].mean()
round(avg_gold, 2)

797.15

### 5. How many orders were placed for restaurants with rating ≥ 4.5?

In [39]:
(df["rating"] >= 4.5).sum()

3374

### 6. How many orders were placed in the top revenue city among Gold members only?

In [43]:
gold_df = df[df["membership"] == "Gold"]

orders_in_top_city = len(
    gold_df[gold_df["city"] ==
            gold_df.groupby("city")["total_amount"].sum().idxmax()]
)

orders_in_top_city

1337

In [45]:
df.shape

(10000, 14)

In [47]:
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating,rating_range,quarter
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2,3.0–3.5,1
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5,4.1–4.5,1
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0,3.6–4.0,3
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8,4.6–5.0,4
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0,3.0–3.5,4